DriverTest/Res1/StRes1/Report/Data/Step4.js

function _get_dyn_external_content_for_st(){return '<div><style>.basic-block table td.no-border{padding-left:0;}</style><div class="st-act-wrapper "><div class="block basic-block"><table><tr><td class="name col-head-style">Name</td><td class="name col-head-style">Step ID</td><td class="name col-head-style">Status</td><td class="name col-head-style">Message</td></tr><tr><td class="value col-head-style">CreateFlightOrder</td><td class="value col-head-style">StServiceCallActivity5</td><td class="value col-head-style">Done</td><td class="value col-head-style">Web service call performed successfully</td></tr></table></div><div class="block other-props-block"><div class="block-title">More</div><table><tr><td class="name row-head-style">InputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity5_InputXml_621c1841-4488-4bd1-97a2-c40d37e7c2cf.xml\', \'Data/StServiceCallActivity5_InputXml_621c1841-4488-4bd1-97a2-c40d37e7c2cf-js4hrpt.js\', \'.xml\', \'InputXml\');return false;">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n  &lt;Body&gt;\r\n    &lt;CreateFlightOrder xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;FlightOrder&gt;\r\n        &lt;Class&gt;Business&lt;/Class&gt;\r\n        &lt;CustomerName&gt;Ron S&lt;/CustomerName&gt;\r\n        &lt;DepartureDate&gt;2022-01-01T00:00:00+00:00&lt;/DepartureDate&gt;\r\n        &lt;FlightNumber&gt;10436&lt;/FlightNumber&gt;\r\n        &lt;NumberOfTickets&gt;2&lt;/NumberOfTickets&gt;\r\n      &lt;/FlightOrder&gt;\r\n    &lt;/CreateFlightOrder&gt;\r\n  &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Service</td><td class="value row-head-style">Flights_Service</td></tr><tr><td class="name row-head-style">Port</td><td class="value row-head-style">FlightsServiceMethods</td></tr><tr><td class="name row-head-style">Operation</td><td class="value row-head-style">CreateFlightOrder</td></tr><tr><td class="name row-head-style">Address</td><td class="value row-head-style">http://localhost:8000/Flights_SOAP</td></tr><tr><td class="name row-head-style">SOAPAction</td><td class="value row-head-style">HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder</td></tr><tr><td class="name row-head-style">ContentType</td><td class="value row-head-style">text/xml; charset=utf-8</td></tr><tr><td class="name row-head-style">MessageExchangePattern</td><td class="value row-head-style">Request Response</td></tr><tr><td class="name row-head-style">Full request</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity5_Full_request_995cdee3-59ef-440f-a941-158132937bd3.xml\', \'Data/StServiceCallActivity5_Full_request_995cdee3-59ef-440f-a941-158132937bd3-js4hrpt.js\', \'.xml\', \'Full request\');return false;">&lt;?xml version="1.0"? ... &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">InputHeader</td><td class="value row-head-style">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder\nContent-Type:	text/xml; charset=utf-8\nHost:	localhost:8000\nContent-Length:	412\nConnection:	Close\n</td></tr><tr><td class="name row-head-style">OutputHeader</td><td class="value row-head-style">Connection:	close\nContent-Length:	337\nContent-Type:	text/xml; charset=utf-8\nDate:	Fri, 11 Jun 2021 16:14:07 GMT\nServer:	Microsoft-HTTPAPI/2.0\n</td></tr><tr><td class="name row-head-style">OutputText</td><td class="value row-head-style">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;OrderNumber&gt;91&lt;/OrderNumber&gt;&lt;TotalPrice&gt;687.2&lt;/TotalPrice&gt;&lt;/CreateFlightOrderResult&gt;&lt;/CreateFlightOrderResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</td></tr><tr><td class="name row-head-style">HttpStatusCode</td><td class="value row-head-style">200 : OK</td></tr><tr><td class="name row-head-style">OutputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity5_OutputXml_6e78709f-c05f-492c-8a27-7559fe8c5098.xml\', \'Data/StServiceCallActivity5_OutputXml_6e78709f-c05f-492c-8a27-7559fe8c5098-js4hrpt.js\', \'.xml\', \'OutputXml\');return false;">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;s:Body&gt;\r\n    &lt;CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n        &lt;OrderNumber&gt;91&lt;/OrderNumber&gt;\r\n        &lt;TotalPrice&gt;687.2&lt;/TotalPrice&gt;\r\n      &lt;/CreateFlightOrderResult&gt;\r\n    &lt;/CreateFlightOrderResponse&gt;\r\n  &lt;/s:Body&gt;\r\n&lt;/s:Envelope&gt;</a></td></tr> </table></div></div>';}